# HasOpenGeometry Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..HasOpenGeometry Property
Form Class See Also
---
Tell if the form has an open geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool HasOpenGeometry { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasOpenGeometry As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasOpenGeometry {
	bool get ();
}
```

# See Also
Form Class
Autodesk.Revit.DB Namespace